css.org
#+title: Css
* Shit I dont know:
** Select single child (+)
#+begin_src css
//if we have a p followed by a ul, and we want to select the ul this
                                       p + ul{
    color: blue;
}
#+end_src
** Select all siblings (~)
#+begin_src css
//if we want to select all siblings of a ul that are p
ul ~ p{
    color: red;
        }
#+end_src
** selecting a specific element but only using a class
#+begin_src css
//if we have multple p nodes and we want to select only some of them by class

p[class="lmao"]{
    color: green;
        }
#+end_src
** Classes can be shared
#+begin_src html

<head>
  <style type="text/css">
    .a{
        color: yellow;
        }
    .b{
        color: purple;
        }
    .shared{
        padding: 5px;
        }
    </style>
  </head>

<body>
  <p class="a shared">Hi</p>
  <p class="b shared">Hello</p>
</body>

#+end_src
** Pseudo classes (selecting an element in mutlple states)
Let's say we have a button, we want it blue but when we hover over it, we want to change the cursor to be the clicking cursor and make the opacity 80%

#+begin_src css
button{
    color: blue;
        }
button:hover{
    cursor: pointer;
    opacity: 0.8;
        }
#+end_src
** Precedence
*** ID
Worth 100 points
*** class
worth 10 points
*** tag
worth 1 measly point
** !important
can be applied to a CSS property, bypasses all precedence.
** Block vs Inline
- Block respects width and height properties, but inline (an asshole) doesnt.
*** inline block
الحالة الشاذة

Basically an inline element but it respects width and height
*** Can be set using the display property
**  box-sizing: Border box vs Content box
Content box REALLY respects width and height properties, it tries to fit the padding inside it.
** position
can be:
*** static
