css.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-11-08 Tue 18:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Css</title>
<meta name="author" content="Kenan Ismail" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Css</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5925970">1. Shit I dont know:</a>
<ul>
<li><a href="#orga92215c">1.1. Select single child (+)</a></li>
<li><a href="#org4dafb8a">1.2. Select all siblings (~)</a></li>
<li><a href="#org6c6cf68">1.3. selecting a specific element but only using a class</a></li>
<li><a href="#org31887a0">1.4. Classes can be shared</a></li>
<li><a href="#orga08664c">1.5. Pseudo classes (selecting an element in mutlple states)</a></li>
<li><a href="#org1018b1f">1.6. Precedence</a>
<ul>
<li><a href="#org383a7ad">1.6.1. ID</a></li>
<li><a href="#orgcd3ed32">1.6.2. class</a></li>
<li><a href="#org5874c91">1.6.3. tag</a></li>
</ul>
</li>
<li><a href="#org479a558">1.7. !important</a></li>
<li><a href="#org3f8ffd3">1.8. Block vs Inline</a>
<ul>
<li><a href="#org30c1f1d">1.8.1. inline block</a></li>
<li><a href="#orgce5332d">1.8.2. Can be set using the display property</a></li>
</ul>
</li>
<li><a href="#org7631683">1.9. box-sizing: Border box vs Content box</a></li>
<li><a href="#orgc5aa984">1.10. position</a>
<ul>
<li><a href="#org930aae7">1.10.1. static</a></li>
<li><a href="#org40ce433">1.10.2. absolute</a></li>
<li><a href="#org3368c23">1.10.3. relative</a></li>
<li><a href="#org4bb6fab">1.10.4. fixed</a></li>
<li><a href="#org76955bb">1.10.5. sticky</a></li>
</ul>
</li>
<li><a href="#org5804697">1.11. CSS measurement units</a></li>
<li><a href="#org7a295c0">1.12. font-weight</a></li>
<li><a href="#orgb06c346">1.13. border-radius</a></li>
<li><a href="#orgcec1f95">1.14. box-shadow</a></li>
<li><a href="#org959845e">1.15. vertical-align</a></li>
<li><a href="#org8c87aec">1.16. overflow</a></li>
</ul>
</li>
<li><a href="#org691ac78">2. 4 step method to write CSS</a></li>
<li><a href="#org5f50bb2">3. Responsive design</a>
<ul>
<li><a href="#orge6f713b">3.1. Breakpoints</a>
<ul>
<li><a href="#org05ff419">3.1.1. basic syntax</a></li>
<li><a href="#orgd22b0d3">3.1.2. At-rules</a></li>
<li><a href="#org051062f">3.1.3. logical operators</a></li>
</ul>
</li>
<li><a href="#org486a546">3.2. Checklist</a></li>
</ul>
</li>
<li><a href="#org796e74e">4. Flexbox</a>
<ul>
<li><a href="#org9c96b0c">4.1. Parent-child</a></li>
<li><a href="#orgb840930">4.2. Properties</a>
<ul>
<li><a href="#org821c6ea">4.2.1. flex-direction</a></li>
<li><a href="#orgffd6c2f">4.2.2. justify-content</a></li>
<li><a href="#org56aaaf4">4.2.3. align-items</a></li>
<li><a href="#org8fa9b98">4.2.4. flex-wrap</a></li>
<li><a href="#org8938653">4.2.5. align-self</a></li>
<li><a href="#orgd24377b">4.2.6. flex-grow</a></li>
<li><a href="#org8e8257d">4.2.7. flex-shrink</a></li>
<li><a href="#org98d81ab">4.2.8. flex-basis</a></li>
<li><a href="#org89f4906">4.2.9. order</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgbfb14b6">5. CSS grid</a>
<ul>
<li><a href="#orge8a411b">5.1. grid-template-rows and grid-template-colums</a></li>
<li><a href="#org5a847b3">5.2. fractional units (Xfr)</a></li>
<li><a href="#org877ee70">5.3. Placing elements</a>
<ul>
<li><a href="#org1faaa24">5.3.1. grid-column-start and grid-column-end</a></li>
</ul>
</li>
<li><a href="#orge74f04e">5.4. The grid area</a>
<ul>
<li><a href="#orgd12bbad">5.4.1. justify-items and align-items</a></li>
<li><a href="#org04de72a">5.4.2. justify-self and align-self</a></li>
</ul>
</li>
<li><a href="#orgd192dcb">5.5. justify-content and align-content</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5925970" class="outline-2">
<h2 id="org5925970"><span class="section-number-2">1.</span> Shit I dont know:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orga92215c" class="outline-3">
<h3 id="orga92215c"><span class="section-number-3">1.1.</span> Select single child (+)</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">
<pre class="src src-css">//if we have a p followed by a ul, and we want to select the ul this
                                       <span style="color: #51afef;">p + ul</span>{
    <span style="color: #98be65;">color</span>: <span style="color: #ffffff; background-color: #0000ff;">blue</span>;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4dafb8a" class="outline-3">
<h3 id="org4dafb8a"><span class="section-number-3">1.2.</span> Select all siblings (~)</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-css">//if we want to select all siblings of a ul that are p
<span style="color: #51afef;">ul ~ p</span>{
    <span style="color: #98be65;">color</span>: <span style="color: #ffffff; background-color: #ff0000;">red</span>;
        }
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c6cf68" class="outline-3">
<h3 id="org6c6cf68"><span class="section-number-3">1.3.</span> selecting a specific element but only using a class</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-css">//if we have multple p nodes and we want to select only some of them by class

<span style="color: #51afef;">p[class=</span><span style="color: #98be65;">"lmao"</span><span style="color: #51afef;">]</span>{
    <span style="color: #98be65;">color</span>: <span style="color: #ffffff; background-color: #008000;">green</span>;
        }
</pre>
</div>
</div>
</div>
<div id="outline-container-org31887a0" class="outline-3">
<h3 id="org31887a0"><span class="section-number-3">1.4.</span> Classes can be shared</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-html">
&lt;<span style="color: #c678dd;">head</span>&gt;
  &lt;<span style="color: #c678dd;">style</span> <span style="color: #dcaeea;">type</span>=<span style="color: #98be65;">"text/css"</span>&gt;
    .a{
        color: yellow;
        }
    .b{
        color: purple;
        }
    .shared{
        padding: 5px;
        }
    &lt;/<span style="color: #c678dd;">style</span>&gt;
  &lt;/<span style="color: #c678dd;">head</span>&gt;

&lt;<span style="color: #c678dd;">body</span>&gt;
  &lt;<span style="color: #c678dd;">p</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"a shared"</span>&gt;Hi&lt;/<span style="color: #c678dd;">p</span>&gt;
  &lt;<span style="color: #c678dd;">p</span> <span style="color: #dcaeea;">class</span>=<span style="color: #98be65;">"b shared"</span>&gt;Hello&lt;/<span style="color: #c678dd;">p</span>&gt;
&lt;/<span style="color: #c678dd;">body</span>&gt;

</pre>
</div>
</div>
</div>
<div id="outline-container-orga08664c" class="outline-3">
<h3 id="orga08664c"><span class="section-number-3">1.5.</span> Pseudo classes (selecting an element in mutlple states)</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Let&rsquo;s say we have a button, we want it blue but when we hover over it, we want to change the cursor to be the clicking cursor and make the opacity 80%
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #51afef;">button</span>{
    <span style="color: #98be65;">color</span>: <span style="color: #ffffff; background-color: #0000ff;">blue</span>;
        }
<span style="color: #51afef;">button:hover</span>{
    <span style="color: #98be65;">cursor</span>: pointer;
    <span style="color: #98be65;">opacity</span>: <span style="color: #da8548; font-weight: bold;">0.8</span>;
        }
</pre>
</div>
</div>
</div>
<div id="outline-container-org1018b1f" class="outline-3">
<h3 id="org1018b1f"><span class="section-number-3">1.6.</span> Precedence</h3>
<div class="outline-text-3" id="text-1-6">
</div>
<div id="outline-container-org383a7ad" class="outline-4">
<h4 id="org383a7ad"><span class="section-number-4">1.6.1.</span> ID</h4>
<div class="outline-text-4" id="text-1-6-1">
<p>
Worth 100 points
</p>
</div>
</div>
<div id="outline-container-orgcd3ed32" class="outline-4">
<h4 id="orgcd3ed32"><span class="section-number-4">1.6.2.</span> class</h4>
<div class="outline-text-4" id="text-1-6-2">
<p>
worth 10 points
</p>
</div>
</div>
<div id="outline-container-org5874c91" class="outline-4">
<h4 id="org5874c91"><span class="section-number-4">1.6.3.</span> tag</h4>
<div class="outline-text-4" id="text-1-6-3">
<p>
worth 1 measly point
</p>
</div>
</div>
</div>
<div id="outline-container-org479a558" class="outline-3">
<h3 id="org479a558"><span class="section-number-3">1.7.</span> !important</h3>
<div class="outline-text-3" id="text-1-7">
<p>
can be applied to a CSS property, bypasses all precedence.
</p>
</div>
</div>
<div id="outline-container-org3f8ffd3" class="outline-3">
<h3 id="org3f8ffd3"><span class="section-number-3">1.8.</span> Block vs Inline</h3>
<div class="outline-text-3" id="text-1-8">
<ul class="org-ul">
<li>Block respects width and height properties, but inline (an asshole) doesnt.</li>
</ul>
</div>
<div id="outline-container-org30c1f1d" class="outline-4">
<h4 id="org30c1f1d"><span class="section-number-4">1.8.1.</span> inline block</h4>
<div class="outline-text-4" id="text-1-8-1">
<p>
الحالة الشاذة
</p>

<p>
Basically an inline element but it respects width and height
</p>
</div>
</div>
<div id="outline-container-orgce5332d" class="outline-4">
<h4 id="orgce5332d"><span class="section-number-4">1.8.2.</span> Can be set using the display property</h4>
</div>
</div>
<div id="outline-container-org7631683" class="outline-3">
<h3 id="org7631683"><span class="section-number-3">1.9.</span> box-sizing: Border box vs Content box</h3>
<div class="outline-text-3" id="text-1-9">
<p>
Content box REALLY respects width and height properties, it tries to fit the padding inside it.
</p>
</div>
</div>
