css.tex
% Created 2022-11-08 Tue 18:34
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Kenan Ismail}
\date{\today}
\title{Css}
\hypersetup{
 pdfauthor={Kenan Ismail},
 pdftitle={Css},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.6)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Shit I dont know:}
\label{sec:org3ca466f}
\subsection{Select single child (+)}
\label{sec:org133b9a1}
\begin{verbatim}
//if we have a p followed by a ul, and we want to select the ul this
                                       p + ul{
    color: blue;
}
\end{verbatim}
\subsection{Select all siblings (\textasciitilde{})}
\label{sec:org34edb9d}
\begin{verbatim}
//if we want to select all siblings of a ul that are p
ul ~ p{
    color: red;
        }
\end{verbatim}
\subsection{selecting a specific element but only using a class}
\label{sec:orga4e1960}
\begin{verbatim}
//if we have multple p nodes and we want to select only some of them by class

p[class="lmao"]{
    color: green;
        }
\end{verbatim}
\subsection{Classes can be shared}
\label{sec:org9c799c7}
\begin{verbatim}

<head>
  <style type="text/css">
    .a{
        color: yellow;
        }
    .b{
        color: purple;
        }
    .shared{
        padding: 5px;
        }
    </style>
  </head>

<body>
  <p class="a shared">Hi</p>
  <p class="b shared">Hello</p>
</body>

\end{verbatim}
\subsection{Pseudo classes (selecting an element in mutlple states)}
\label{sec:org02c2688}
Let's say we have a button, we want it blue but when we hover over it, we want to change the cursor to be the clicking cursor and make the opacity 80\%

\begin{verbatim}
button{
    color: blue;
        }
button:hover{
    cursor: pointer;
    opacity: 0.8;
        }
\end{verbatim}
\subsection{Precedence}
\label{sec:org6c1350b}
\subsubsection{ID}
\label{sec:orgf5f1b76}
Worth 100 points
\subsubsection{class}
\label{sec:org751c802}
worth 10 points
\subsubsection{tag}
\label{sec:org900ea2a}
worth 1 measly point
\subsection{!important}
\label{sec:org0e64b98}
can be applied to a CSS property, bypasses all precedence.
\subsection{Block vs Inline}
\label{sec:org51e3c97}
\begin{itemize}
\item Block respects width and height properties, but inline (an asshole) doesnt.
\end{itemize}
\subsubsection{inline block}
\label{sec:org995630b}
الحالة الشاذة

Basically an inline element but it respects width and height
\subsubsection{Can be set using the display property}
\label{sec:orgd7d0176}
\subsection{box-sizing: Border box vs Content box}
\label{sec:orga45b948}
Content box REALLY respects width and height properties, it tries to fit the padding inside it.
