css.org
*** absolute
- if it is a child of a relative element, then its position will depend on that element, otherwise it will be like fixed (dependent on viewport)
*** relative
 - Provides a 'z-index' basically layers, the higher the index the more it is on top.
 - margins are also now 'relative' to the object itself, for example if an object exists on x:10y:10 and we make a margin in a relative position of 10, then the y will be 20 not 10.
 - the child of a relative can have an absolute position
*** fixed
- Used for navbars, commonly with width=100vw;
- You also must specify the offset from its parent element (top: 0;)
- It no longer takes space in the body
*** sticky
** CSS measurement units
- pixels
  pixels
- percentages
  how much % of the viewport container (if the viewport is resized the element will also be resized)
- rem (fonts)
  % increase/decrease of font size dependent on how many pixels it's set at (default is 16px)

  so 1.2em will be 120% of 16px, 20% increase or 1.2*16px
- em (fonts)
  same as rem but it is now relative to the parent element
** font-weight
** border-radius
Use for rounded courners (in px)
** box-shadow
use for shadow

 box-shadow: none|h-offset v-offset blur spread color |inset|initial|inherit;
** vertical-align
** overflow
can be set to *hidden* to hide elements that overflow out of the parent container.

can also be set to *auto* to scroll through overflowing content
* 4 step method to write CSS
- How do i want to arrange the elements on the page?
- How would it look in HTML?
- How can i implement it in CSS instead?
- How should each element be styled?
* Responsive design
** Breakpoints
basically like an if condition for what style of page to display (depending on screen size, etc)
*** basic syntax
#+begin_src css
@media /* logical conditions*/ (min-width: 768px){

 }

 #+end_src
*** At-rules
**** @media
is considered to be an at-rule, it selects which type of device, for example it can be @media screen, @media speech, @media all, etc
**** @supports
checks if a browser supports a feature
*** logical operators
we have logical operators in CSS, and or

For example this code
#+begin_src css
@media only screen and (min-width: 400px) and (max-width: 600px){
    *,*{
        color:red;
    }
        }
#+end_src

Translates to iff the device is a screen, and its width is between 400 to 600 px, style all elements red.
** Checklist
- Fluid layouts - does the content resize on different screens?
- Images - do they maintain a good aspect ratio and size on different screens?
- Text - The text should be comfortable to read on any screen size (rule of thumb, 16px p size, 700px max container size)
- Overflow - nothing should overflow
- Full-width mobile content - dont show columns on mobile, make it all 100% width of vp
- General usability
  + Are buttons big enough?
  + Are most important things showing first?
  + Use your site on an actual phone, you can quickly find out if something needs work.
* Flexbox
Flexbox is a way of organizing elements on one axis.
** Parent-child
If you set an element's display property to 'flexbox', then all its children will be flex items. And element can be a flex item only if its parent is a flex container.
** Properties
