css.html
<div id="outline-container-orgc5aa984" class="outline-3">
<h3 id="orgc5aa984"><span class="section-number-3">1.10.</span> position</h3>
<div class="outline-text-3" id="text-1-10">
<p>
can be:
</p>
</div>
<div id="outline-container-org930aae7" class="outline-4">
<h4 id="org930aae7"><span class="section-number-4">1.10.1.</span> static</h4>
</div>
<div id="outline-container-org40ce433" class="outline-4">
<h4 id="org40ce433"><span class="section-number-4">1.10.2.</span> absolute</h4>
<div class="outline-text-4" id="text-1-10-2">
<ul class="org-ul">
<li>if it is a child of a relative element, then its position will depend on that element, otherwise it will be like fixed (dependent on viewport)</li>
</ul>
</div>
</div>
<div id="outline-container-org3368c23" class="outline-4">
<h4 id="org3368c23"><span class="section-number-4">1.10.3.</span> relative</h4>
<div class="outline-text-4" id="text-1-10-3">
<ul class="org-ul">
<li>Provides a &rsquo;z-index&rsquo; basically layers, the higher the index the more it is on top.</li>
<li>margins are also now &rsquo;relative&rsquo; to the object itself, for example if an object exists on x:10y:10 and we make a margin in a relative position of 10, then the y will be 20 not 10.</li>
<li>the child of a relative can have an absolute position</li>
</ul>
</div>
</div>
<div id="outline-container-org4bb6fab" class="outline-4">
<h4 id="org4bb6fab"><span class="section-number-4">1.10.4.</span> fixed</h4>
<div class="outline-text-4" id="text-1-10-4">
<ul class="org-ul">
<li>Used for navbars, commonly with width=100vw;</li>
<li>You also must specify the offset from its parent element (top: 0;)</li>
<li>It no longer takes space in the body</li>
</ul>
</div>
</div>
<div id="outline-container-org76955bb" class="outline-4">
<h4 id="org76955bb"><span class="section-number-4">1.10.5.</span> sticky</h4>
</div>
</div>
<div id="outline-container-org5804697" class="outline-3">
<h3 id="org5804697"><span class="section-number-3">1.11.</span> CSS measurement units</h3>
<div class="outline-text-3" id="text-1-11">
<ul class="org-ul">
<li>pixels
pixels</li>
<li>percentages
how much % of the viewport container (if the viewport is resized the element will also be resized)</li>
<li><p>
rem (fonts)
% increase/decrease of font size dependent on how many pixels it&rsquo;s set at (default is 16px)
</p>

<p>
so 1.2em will be 120% of 16px, 20% increase or 1.2*16px
</p></li>
<li>em (fonts)
same as rem but it is now relative to the parent element</li>
</ul>
</div>
</div>
<div id="outline-container-org7a295c0" class="outline-3">
<h3 id="org7a295c0"><span class="section-number-3">1.12.</span> font-weight</h3>
</div>
<div id="outline-container-orgb06c346" class="outline-3">
<h3 id="orgb06c346"><span class="section-number-3">1.13.</span> border-radius</h3>
<div class="outline-text-3" id="text-1-13">
<p>
Use for rounded courners (in px)
</p>
</div>
</div>
<div id="outline-container-orgcec1f95" class="outline-3">
<h3 id="orgcec1f95"><span class="section-number-3">1.14.</span> box-shadow</h3>
<div class="outline-text-3" id="text-1-14">
<p>
use for shadow
</p>

<p>
box-shadow: none|h-offset v-offset blur spread color |inset|initial|inherit;
</p>
</div>
</div>
<div id="outline-container-org959845e" class="outline-3">
<h3 id="org959845e"><span class="section-number-3">1.15.</span> vertical-align</h3>
</div>
<div id="outline-container-org8c87aec" class="outline-3">
<h3 id="org8c87aec"><span class="section-number-3">1.16.</span> overflow</h3>
<div class="outline-text-3" id="text-1-16">
<p>
can be set to <b>hidden</b> to hide elements that overflow out of the parent container.
</p>

<p>
can also be set to <b>auto</b> to scroll through overflowing content
</p>
</div>
</div>
</div>
<div id="outline-container-org691ac78" class="outline-2">
<h2 id="org691ac78"><span class="section-number-2">2.</span> 4 step method to write CSS</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>How do i want to arrange the elements on the page?</li>
<li>How would it look in HTML?</li>
<li>How can i implement it in CSS instead?</li>
<li>How should each element be styled?</li>
</ul>
</div>
</div>
<div id="outline-container-org5f50bb2" class="outline-2">
<h2 id="org5f50bb2"><span class="section-number-2">3.</span> Responsive design</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orge6f713b" class="outline-3">
<h3 id="orge6f713b"><span class="section-number-3">3.1.</span> Breakpoints</h3>
<div class="outline-text-3" id="text-3-1">
<p>
basically like an if condition for what style of page to display (depending on screen size, etc)
</p>
</div>
<div id="outline-container-org05ff419" class="outline-4">
<h4 id="org05ff419"><span class="section-number-4">3.1.1.</span> basic syntax</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">
<pre class="src src-css"><span style="color: #c678dd;">@media</span> <span style="color: #5B6268;">/* </span><span style="color: #5B6268;">logical conditions</span><span style="color: #5B6268;">*/</span> (min-width: 768px){

 }

</pre>
</div>
</div>
</div>
<div id="outline-container-orgd22b0d3" class="outline-4">
<h4 id="orgd22b0d3"><span class="section-number-4">3.1.2.</span> At-rules</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<ol class="org-ol">
<li><a id="orgf022db0"></a>@media<br />
<div class="outline-text-5" id="text-3-1-2-1">
<p>
is considered to be an at-rule, it selects which type of device, for example it can be @media screen, @media speech, @media all, etc
</p>
</div>
</li>
<li><a id="org9848bf5"></a>@supports<br />
<div class="outline-text-5" id="text-3-1-2-2">
<p>
checks if a browser supports a feature
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org051062f" class="outline-4">
<h4 id="org051062f"><span class="section-number-4">3.1.3.</span> logical operators</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
we have logical operators in CSS, and or
</p>

<p>
For example this code
</p>
<div class="org-src-container">
<pre class="src src-css"><span style="color: #c678dd;">@media</span> only screen and (min-width: 400px) and (max-width: 600px){
    <span style="color: #51afef;">*,*</span>{
        <span style="color: #98be65;">color</span>:<span style="color: #ffffff; background-color: #ff0000;">red</span>;
    }
        }
</pre>
</div>

<p>
Translates to iff the device is a screen, and its width is between 400 to 600 px, style all elements red.
</p>
</div>
</div>
</div>
<div id="outline-container-org486a546" class="outline-3">
<h3 id="org486a546"><span class="section-number-3">3.2.</span> Checklist</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Fluid layouts - does the content resize on different screens?</li>
<li>Images - do they maintain a good aspect ratio and size on different screens?</li>
<li>Text - The text should be comfortable to read on any screen size (rule of thumb, 16px p size, 700px max container size)</li>
<li>Overflow - nothing should overflow</li>
<li>Full-width mobile content - dont show columns on mobile, make it all 100% width of vp</li>
<li>General usability
<ul class="org-ul">
<li>Are buttons big enough?</li>
<li>Are most important things showing first?</li>
<li>Use your site on an actual phone, you can quickly find out if something needs work.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org796e74e" class="outline-2">
<h2 id="org796e74e"><span class="section-number-2">4.</span> Flexbox</h2>
<div class="outline-text-2" id="text-4">
<p>
Flexbox is a way of organizing elements on one axis.
</p>
</div>
<div id="outline-container-org9c96b0c" class="outline-3">
<h3 id="org9c96b0c"><span class="section-number-3">4.1.</span> Parent-child</h3>
<div class="outline-text-3" id="text-4-1">
<p>
If you set an element&rsquo;s display property to &rsquo;flexbox&rsquo;, then all its children will be flex items. And element can be a flex item only if its parent is a flex container.
</p>
</div>
</div>
