css.tex
\subsection{position}
\label{sec:orgd01f5f6}
can be:
\subsubsection{static}
\label{sec:org890436f}
\subsubsection{absolute}
\label{sec:org1ad20df}
\begin{itemize}
\item if it is a child of a relative element, then its position will depend on that element, otherwise it will be like fixed (dependent on viewport)
\end{itemize}
\subsubsection{relative}
\label{sec:orge5100e6}
\begin{itemize}
\item Provides a 'z-index' basically layers, the higher the index the more it is on top.
\item margins are also now 'relative' to the object itself, for example if an object exists on x:10y:10 and we make a margin in a relative position of 10, then the y will be 20 not 10.
\item the child of a relative can have an absolute position
\end{itemize}
\subsubsection{fixed}
\label{sec:org71d387e}
\begin{itemize}
\item Used for navbars, commonly with width=100vw;
\item You also must specify the offset from its parent element (top: 0;)
\item It no longer takes space in the body
\end{itemize}
\subsubsection{sticky}
\label{sec:org09d28c9}
\subsection{CSS measurement units}
\label{sec:org9ba28b8}
\begin{itemize}
\item pixels
pixels
\item percentages
how much \% of the viewport container (if the viewport is resized the element will also be resized)
\item rem (fonts)
\% increase/decrease of font size dependent on how many pixels it's set at (default is 16px)

so 1.2em will be 120\% of 16px, 20\% increase or 1.2*16px
\item em (fonts)
same as rem but it is now relative to the parent element
\end{itemize}
\subsection{font-weight}
\label{sec:org88e30bc}
\subsection{border-radius}
\label{sec:org066db6a}
Use for rounded courners (in px)
\subsection{box-shadow}
\label{sec:org54d9c15}
use for shadow

box-shadow: none|h-offset v-offset blur spread color |inset|initial|inherit;
\subsection{vertical-align}
\label{sec:orgc1cdc4f}
\subsection{overflow}
\label{sec:org99122e6}
can be set to \textbf{hidden} to hide elements that overflow out of the parent container.

can also be set to \textbf{auto} to scroll through overflowing content
\section{4 step method to write CSS}
\label{sec:org42be59b}
\begin{itemize}
\item How do i want to arrange the elements on the page?
\item How would it look in HTML?
\item How can i implement it in CSS instead?
\item How should each element be styled?
\end{itemize}
\section{Responsive design}
\label{sec:orgd61afae}
\subsection{Breakpoints}
\label{sec:org0c82751}
basically like an if condition for what style of page to display (depending on screen size, etc)
\subsubsection{basic syntax}
\label{sec:orgaa041bd}
\begin{verbatim}
@media /* logical conditions*/ (min-width: 768px){

 }

\end{verbatim}
\subsubsection{At-rules}
\label{sec:org03a3c6a}
\begin{enumerate}
\item @media
\label{sec:org3e32262}
is considered to be an at-rule, it selects which type of device, for example it can be @media screen, @media speech, @media all, etc
\item @supports
\label{sec:org4663856}
checks if a browser supports a feature
\end{enumerate}
\subsubsection{logical operators}
\label{sec:org10ff6bc}
we have logical operators in CSS, and or

For example this code
\begin{verbatim}
@media only screen and (min-width: 400px) and (max-width: 600px){
    *,*{
        color:red;
    }
        }
\end{verbatim}

Translates to iff the device is a screen, and its width is between 400 to 600 px, style all elements red.
\subsection{Checklist}
\label{sec:org53bd976}
\begin{itemize}
\item Fluid layouts - does the content resize on different screens?
\item Images - do they maintain a good aspect ratio and size on different screens?
\item Text - The text should be comfortable to read on any screen size (rule of thumb, 16px p size, 700px max container size)
\item Overflow - nothing should overflow
\item Full-width mobile content - dont show columns on mobile, make it all 100\% width of vp
\item General usability
\begin{itemize}
\item Are buttons big enough?
\item Are most important things showing first?
\item Use your site on an actual phone, you can quickly find out if something needs work.
\end{itemize}
\end{itemize}
\section{Flexbox}
\label{sec:org78ace2f}
Flexbox is a way of organizing elements on one axis.
\subsection{Parent-child}
\label{sec:org8c56001}
If you set an element's display property to 'flexbox', then all its children will be flex items. And element can be a flex item only if its parent is a flex container.
