css.org
*** flex-direction
Sets the axis, can be row wise or column wise.
*** justify-content
Imagine that you have a white page in ms word, this is your container, and the children is the text. The same way you justify stuff there, applies here, sort of.

**** : start
the default, makes elements start from the origin of the axis
**** : end
Makes elements begin from the end of the axis
**** : center
Centers the elements (to the center of the container)
**** : space-between
makes the elements spread throughout the whole container with spaces in between
**** : space-around
same as above but puts spaces at the ends too
**** : space-evenly
inverse of space-between
*** align-items
For aligining items on the cross axis. (vertically)

*setting width and height manually overrides this*
**** normal
stretch
**** stretch
stretch item to container
**** center
**** flex-start
**** flex-end
**** baseline
*** flex-wrap
**** wrap
the way to handle overflow in flexbox, makes stuff appear in a grid.

*Important* If we set this, then we no longer use align-items, we use *align-content* instead!
*** align-self
when you want to change the alignment of 1 flexitem only
*** flex-grow
how much to use up of available space using free space units
*** flex-shrink
how much to shrink a flexitem using overflow units. Keep in mind that each item has a minimum size and wont shrink past that.
*** flex-basis
by default it's auto, but basically this takes precedence over any other flex sizing property to change the size
*** order
used to change the order of the flexitems
* CSS grid
First of all, set the display property to grid.
** grid-template-rows and grid-template-colums
creates a grid with a defined number of rows and columns, can be used in conjunction with the repeat() css function.

#+begin_src css
someselector{
    display: grid;
    grid-template-rows: 30px 30px 30px;
    grid-template-columns: 20px 30px;
    /*creates a 3x2 grid*/
}

anotherselector{
    display: grid;
    grid-template-rows: repeat(3,30px);
    grid-template-columns: repeat(2,20px);
    /*same as the above*/
}
#+end_src
** fractional units (Xfr)
a unit of scale in css grid, the above example but with 1fr instead of 30px
** Placing elements
*** grid-column-start and grid-column-end
Basically these properties tell us when to begin the element and when to end it inside our css grid. this is to be used by *the children* of the css grid element.
** The grid area
what we defined above is actually the grid area. When we set the width and height of our child elements, it needs to fit inside the grid area.
*** justify-items and align-items
to be used in the parent (css grid) element, affects the placement of the child elements within their grid area, can be set the same values as its counterpart in flexbox. (default is stretch)
*** justify-self and align-self
the same as the above but to be used by the child elements (if you want to target only one element)
** justify-content and align-content
Acts on the css grid element (parent) itself to position the element. same properties as flexbox.
