css.html
<div id="outline-container-orgb840930" class="outline-3">
<h3 id="orgb840930"><span class="section-number-3">4.2.</span> Properties</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org821c6ea" class="outline-4">
<h4 id="org821c6ea"><span class="section-number-4">4.2.1.</span> flex-direction</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Sets the axis, can be row wise or column wise.
</p>
</div>
</div>
<div id="outline-container-orgffd6c2f" class="outline-4">
<h4 id="orgffd6c2f"><span class="section-number-4">4.2.2.</span> justify-content</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
Imagine that you have a white page in ms word, this is your container, and the children is the text. The same way you justify stuff there, applies here, sort of.
</p>
</div>

<ol class="org-ol">
<li><a id="orga00f92d"></a>: start<br />
<div class="outline-text-5" id="text-4-2-2-1">
<p>
the default, makes elements start from the origin of the axis
</p>
</div>
</li>
<li><a id="org19431a7"></a>: end<br />
<div class="outline-text-5" id="text-4-2-2-2">
<p>
Makes elements begin from the end of the axis
</p>
</div>
</li>
<li><a id="org82b1d3a"></a>: center<br />
<div class="outline-text-5" id="text-4-2-2-3">
<p>
Centers the elements (to the center of the container)
</p>
</div>
</li>
<li><a id="org55a9a91"></a>: space-between<br />
<div class="outline-text-5" id="text-4-2-2-4">
<p>
makes the elements spread throughout the whole container with spaces in between
</p>
</div>
</li>
<li><a id="orgdac5398"></a>: space-around<br />
<div class="outline-text-5" id="text-4-2-2-5">
<p>
same as above but puts spaces at the ends too
</p>
</div>
</li>
<li><a id="orgd99c94b"></a>: space-evenly<br />
<div class="outline-text-5" id="text-4-2-2-6">
<p>
inverse of space-between
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org56aaaf4" class="outline-4">
<h4 id="org56aaaf4"><span class="section-number-4">4.2.3.</span> align-items</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
For aligining items on the cross axis. (vertically)
</p>

<p>
<b>setting width and height manually overrides this</b>
</p>
</div>
<ol class="org-ol">
<li><a id="orgfd3958b"></a>normal<br />
<div class="outline-text-5" id="text-4-2-3-1">
<p>
stretch
</p>
</div>
</li>
<li><a id="orgb90d17d"></a>stretch<br />
<div class="outline-text-5" id="text-4-2-3-2">
<p>
stretch item to container
</p>
</div>
</li>
<li><a id="org510e9e0"></a>center<br /></li>
<li><a id="org537acd2"></a>flex-start<br /></li>
<li><a id="org750f215"></a>flex-end<br /></li>
<li><a id="org6f9e380"></a>baseline<br /></li>
</ol>
</div>
<div id="outline-container-org8fa9b98" class="outline-4">
<h4 id="org8fa9b98"><span class="section-number-4">4.2.4.</span> flex-wrap</h4>
<div class="outline-text-4" id="text-4-2-4">
</div>
<ol class="org-ol">
<li><a id="org222e6fe"></a>wrap<br />
<div class="outline-text-5" id="text-4-2-4-1">
<p>
the way to handle overflow in flexbox, makes stuff appear in a grid.
</p>

<p>
<b>Important</b> If we set this, then we no longer use align-items, we use <b>align-content</b> instead!
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8938653" class="outline-4">
<h4 id="org8938653"><span class="section-number-4">4.2.5.</span> align-self</h4>
<div class="outline-text-4" id="text-4-2-5">
<p>
when you want to change the alignment of 1 flexitem only
</p>
</div>
</div>
<div id="outline-container-orgd24377b" class="outline-4">
<h4 id="orgd24377b"><span class="section-number-4">4.2.6.</span> flex-grow</h4>
<div class="outline-text-4" id="text-4-2-6">
<p>
how much to use up of available space using free space units
</p>
</div>
</div>
<div id="outline-container-org8e8257d" class="outline-4">
<h4 id="org8e8257d"><span class="section-number-4">4.2.7.</span> flex-shrink</h4>
<div class="outline-text-4" id="text-4-2-7">
<p>
how much to shrink a flexitem using overflow units. Keep in mind that each item has a minimum size and wont shrink past that.
</p>
</div>
</div>
<div id="outline-container-org98d81ab" class="outline-4">
<h4 id="org98d81ab"><span class="section-number-4">4.2.8.</span> flex-basis</h4>
<div class="outline-text-4" id="text-4-2-8">
<p>
by default it&rsquo;s auto, but basically this takes precedence over any other flex sizing property to change the size
</p>
</div>
</div>
<div id="outline-container-org89f4906" class="outline-4">
<h4 id="org89f4906"><span class="section-number-4">4.2.9.</span> order</h4>
<div class="outline-text-4" id="text-4-2-9">
<p>
used to change the order of the flexitems
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbfb14b6" class="outline-2">
<h2 id="orgbfb14b6"><span class="section-number-2">5.</span> CSS grid</h2>
<div class="outline-text-2" id="text-5">
<p>
First of all, set the display property to grid.
</p>
</div>
<div id="outline-container-orge8a411b" class="outline-3">
<h3 id="orge8a411b"><span class="section-number-3">5.1.</span> grid-template-rows and grid-template-colums</h3>
<div class="outline-text-3" id="text-5-1">
<p>
creates a grid with a defined number of rows and columns, can be used in conjunction with the repeat() css function.
</p>

<div class="org-src-container">
<pre class="src src-css"><span style="color: #51afef;">someselector</span>{
    <span style="color: #98be65;">display</span>: grid;
    <span style="color: #98be65;">grid-template-rows</span>: 30px 30px 30px;
    <span style="color: #98be65;">grid-template-columns</span>: 20px 30px;
    <span style="color: #5B6268;">/*</span><span style="color: #5B6268;">creates a 3x2 grid</span><span style="color: #5B6268;">*/</span>
}

<span style="color: #51afef;">anotherselector</span>{
    <span style="color: #98be65;">display</span>: grid;
    <span style="color: #98be65;">grid-template-rows</span>: repeat(<span style="color: #da8548; font-weight: bold;">3</span>,30px);
    <span style="color: #98be65;">grid-template-columns</span>: repeat(<span style="color: #da8548; font-weight: bold;">2</span>,20px);
    <span style="color: #5B6268;">/*</span><span style="color: #5B6268;">same as the above</span><span style="color: #5B6268;">*/</span>
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org5a847b3" class="outline-3">
<h3 id="org5a847b3"><span class="section-number-3">5.2.</span> fractional units (Xfr)</h3>
<div class="outline-text-3" id="text-5-2">
<p>
a unit of scale in css grid, the above example but with 1fr instead of 30px
</p>
</div>
</div>
<div id="outline-container-org877ee70" class="outline-3">
<h3 id="org877ee70"><span class="section-number-3">5.3.</span> Placing elements</h3>
<div class="outline-text-3" id="text-5-3">
</div>
<div id="outline-container-org1faaa24" class="outline-4">
<h4 id="org1faaa24"><span class="section-number-4">5.3.1.</span> grid-column-start and grid-column-end</h4>
<div class="outline-text-4" id="text-5-3-1">
<p>
Basically these properties tell us when to begin the element and when to end it inside our css grid. this is to be used by <b>the children</b> of the css grid element.
</p>
</div>
</div>
</div>
<div id="outline-container-orge74f04e" class="outline-3">
<h3 id="orge74f04e"><span class="section-number-3">5.4.</span> The grid area</h3>
<div class="outline-text-3" id="text-5-4">
<p>
what we defined above is actually the grid area. When we set the width and height of our child elements, it needs to fit inside the grid area.
</p>
</div>
<div id="outline-container-orgd12bbad" class="outline-4">
<h4 id="orgd12bbad"><span class="section-number-4">5.4.1.</span> justify-items and align-items</h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
to be used in the parent (css grid) element, affects the placement of the child elements within their grid area, can be set the same values as its counterpart in flexbox. (default is stretch)
</p>
</div>
</div>
<div id="outline-container-org04de72a" class="outline-4">
<h4 id="org04de72a"><span class="section-number-4">5.4.2.</span> justify-self and align-self</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
the same as the above but to be used by the child elements (if you want to target only one element)
</p>
</div>
</div>
</div>
<div id="outline-container-orgd192dcb" class="outline-3">
<h3 id="orgd192dcb"><span class="section-number-3">5.5.</span> justify-content and align-content</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Acts on the css grid element (parent) itself to position the element. same properties as flexbox.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kenan Ismail</p>
<p class="date">Created: 2022-11-08 Tue 18:34</p>
</div>
</body>
</html>