css.tex
\subsection{Properties}
\label{sec:orgb6ab184}
\subsubsection{flex-direction}
\label{sec:org330c4a9}
Sets the axis, can be row wise or column wise.
\subsubsection{justify-content}
\label{sec:orgd77a9fa}
Imagine that you have a white page in ms word, this is your container, and the children is the text. The same way you justify stuff there, applies here, sort of.

\begin{enumerate}
\item : start
\label{sec:orgdb35914}
the default, makes elements start from the origin of the axis
\item : end
\label{sec:org9c9b7ab}
Makes elements begin from the end of the axis
\item : center
\label{sec:orgd150ae6}
Centers the elements (to the center of the container)
\item : space-between
\label{sec:org5105a5e}
makes the elements spread throughout the whole container with spaces in between
\item : space-around
\label{sec:orgc689ab0}
same as above but puts spaces at the ends too
\item : space-evenly
\label{sec:org0940d27}
inverse of space-between
\end{enumerate}
\subsubsection{align-items}
\label{sec:org1de7976}
For aligining items on the cross axis. (vertically)

\textbf{setting width and height manually overrides this}
\begin{enumerate}
\item normal
\label{sec:org467eadf}
stretch
\item stretch
\label{sec:orgadb53a6}
stretch item to container
\item center
\label{sec:org79c4fe3}
\item flex-start
\label{sec:orgbd162ec}
\item flex-end
\label{sec:org608c1eb}
\item baseline
\label{sec:orgde231fd}
\end{enumerate}
\subsubsection{flex-wrap}
\label{sec:orga242baf}
\begin{enumerate}
\item wrap
\label{sec:org10e3ede}
the way to handle overflow in flexbox, makes stuff appear in a grid.

\textbf{Important} If we set this, then we no longer use align-items, we use \textbf{align-content} instead!
\end{enumerate}
\subsubsection{align-self}
\label{sec:org83ad0bd}
when you want to change the alignment of 1 flexitem only
\subsubsection{flex-grow}
\label{sec:org86a9bde}
how much to use up of available space using free space units
\subsubsection{flex-shrink}
\label{sec:org0a8a1c2}
how much to shrink a flexitem using overflow units. Keep in mind that each item has a minimum size and wont shrink past that.
\subsubsection{flex-basis}
\label{sec:org57400d4}
by default it's auto, but basically this takes precedence over any other flex sizing property to change the size
\subsubsection{order}
\label{sec:org82a4485}
used to change the order of the flexitems
\section{CSS grid}
\label{sec:orgc554953}
First of all, set the display property to grid.
\subsection{grid-template-rows and grid-template-colums}
\label{sec:orgb206b60}
creates a grid with a defined number of rows and columns, can be used in conjunction with the repeat() css function.

\begin{verbatim}
someselector{
    display: grid;
    grid-template-rows: 30px 30px 30px;
    grid-template-columns: 20px 30px;
    /*creates a 3x2 grid*/
}

anotherselector{
    display: grid;
    grid-template-rows: repeat(3,30px);
    grid-template-columns: repeat(2,20px);
    /*same as the above*/
}
\end{verbatim}
\subsection{fractional units (Xfr)}
\label{sec:org033bbbe}
a unit of scale in css grid, the above example but with 1fr instead of 30px
\subsection{Placing elements}
\label{sec:org14943f6}
\subsubsection{grid-column-start and grid-column-end}
\label{sec:orgef8d0ec}
Basically these properties tell us when to begin the element and when to end it inside our css grid. this is to be used by \textbf{the children} of the css grid element.
\subsection{The grid area}
\label{sec:org6ad7513}
what we defined above is actually the grid area. When we set the width and height of our child elements, it needs to fit inside the grid area.
\subsubsection{justify-items and align-items}
\label{sec:org947ef96}
to be used in the parent (css grid) element, affects the placement of the child elements within their grid area, can be set the same values as its counterpart in flexbox. (default is stretch)
\subsubsection{justify-self and align-self}
\label{sec:orgbc7def4}
the same as the above but to be used by the child elements (if you want to target only one element)
\subsection{justify-content and align-content}
\label{sec:org6f7833f}
Acts on the css grid element (parent) itself to position the element. same properties as flexbox.
\end{document}